import { title } from "process";


 export const CssSeoData ={
    /* TODO MAIN PAGE */
        "/main":{
            title:"NazDevLite — Бесплатные онлайн-курсы по программированию и веб-разработке",
            description:"Обучайся современным технологиям вместе с nazDev! Курсы по HTML, CSS, JavaScript, React и другим направлениям. Практика, понятные объяснения и поддержка — стартуй путь в IT с нами"
        },

    /* TODO CSS */
        "/css":{
            title:"Полный курс по CSS — стилизация и адаптивность | NazDev",
            description:"Научись оформлять сайты с помощью CSS: селекторы, позиционирование, Flexbox, анимации и адаптивная вёрстка",
        },
        "/css/position":{
            title:"Позиционирование в CSS — static, relative, absolute, fixed | NazDev",
            description:" Разберись в системах позиционирования элементов на странице: от базового до абсолютного и фиксированного. С примерами и лайфхаками"
        },
        "/css/selectors":{
            title:" CSS селекторы — выбор элементов на странице | NazDev",
            description:" Освой работу с CSS-селекторами: классы, ID, вложенность, псевдоклассы и атрибуты. Точная стилизация любого элемента."
        },
        "/css/imges":{
            title:" Изображения в CSS — вставка, размеры, адаптив | NazDev",
            description:"Научись грамотно вставлять и стилизовать изображения в HTML и CSS. Поддержка адаптивности и оптимизация"
        },
        "/css/adaptivs":{
            title:" Адаптивный дизайн в CSS — media-запросы и масштабирование | NazDe",
            description:"Узнай, как создать сайт, который выглядит хорошо на любом устройстве. Media-запросы, единицы измерения и гибкие макеты."
        },
        "/css/flex":{
            title:" Flexbox в CSS — выравнивание и распределение | NazDev",
            description:" Освой современный способ размещения элементов в строку и столбец. Простые объяснения, примеры и практические задания."
        },
        "/css/transform":{
            title:" CSS трансформации и переходы — анимация без JS | NazDev",
            description:"Узнай, как плавно изменять стиль элементов с помощью transform и transition. Примеры вращения, масштабирования и движения."
        },
        "/css/animation":{
            title:"Анимации в CSS — от keyframes до wow-эффектов | NazDev",
            description:"Создавай живые и динамичные интерфейсы с CSS-анимациями. Научись управлять движением, длительностью и стилем."
        },
        "/css/preprocessors":{
            title:"CSS препроцессоры — Sass и Less для удобной вёрстки | NazDev",
            description:" Изучи возможности препроцессоров CSS: переменные, вложенность, миксины и шаблоны. Ускорь и структурируй стилизацию."
        },
        /* TODO HTML */
        "/html":{
            title:"HTML для начинающих — структура и семантика | NazDev",
            description:"Освой основы HTML: теги, атрибуты, формы и семантическая разметка. Пошаговые уроки и практические задания"
        },
        "/html/introduction":{
            title:"Введение в HTML — первые шаги в вёрстке | NazDev",
            description:"Познакомься с HTML и узнай, как устроена структура веб-страниц. Простые примеры, понятные объяснения и начало пути в веб-разработке."
        },
        "/html/links":{
            title:"  Ссылки в HTML — теги, атрибуты и навигация | NazDev",
            description:" Научись создавать ссылки, навигационные меню и переходы между страницами"
        },
        "/html/semantics":{
            title:"Семантическая разметка HTML — структура с смыслом | NazDev",
            description:"Используй теги header, article, main, footer и другие, чтобы создавать осмысленную структуру сайта. Важно для SEO и доступности."
        },
        "/html/media":{
            title:" Медиа в HTML — вставка изображений, видео и аудио | NazDev",
            description:"Узнай, как вставлять изображения, видео и аудио на страницу с помощью HTML. Поддержка форматов и базовые атрибуты."
        },
        "/html/forms":{
            title:"Формы в HTML — ввод данных и взаимодействие | NazDev",
            description:"Освой создание форм: поля ввода, кнопки, чекбоксы, выпадающие списки и отправка данных. Основы валидации и структуры формы."
        },
        "html/metadata":{
            title:"",
            description:""
        },

        /* TODO REACT */
        "/react":{
            title:"React с нуля — создаём интерактивные интерфейсы | NazDev",
            description:"Погрузись в мир React: компоненты, состояния, маршрутизация и хуки. Практические проекты и современные подходы"
        },
        "/react/jsx":{
            title:" Основы JSX в React — Пишем HTML в JavaScript",
            description:"Научись использовать JSX — синтаксис, объединяющий JavaScript и HTML для удобной разработки компонентов в React."
        },
        "/react/components":{
            title:" Компоненты в React — Создание переиспользуемых элементов",
            description:"Разберись с компонентной моделью React и научись строить гибкие и масштабируемые интерфейсы."
        },
        "/react/state":{
            title:": React State — Управление состоянием компонентов",
            description:"Пойми, как работает state в React и как он помогает управлять динамическими данными в интерфейсе."
        },
        "/react/events":{
            title:"Обработка событий в React — Реакция на действия пользователя",
            description:"Научись обрабатывать клики, ввод данных и другие события в React-приложениях."
        },
        "/react/routing":{
            title:"Routing в React — Навигация между страницами",
            description:"Освой маршрутизацию с React Router и научись создавать многостраничные приложения с плавным переходом между экранами."
        },    

    }